import './models/modal_details.dart';

final List<Modaldetails> modaldetailistdummy = [
  Modaldetails(
      id: 'c1',
      title: ' أذكار الصباح  ',
      description:
          ' اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. - البقرة 255   ',
      descriotion2:
          'بسـم الله الـذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم. (3 مرات)',
      descriotion3:
          '  رضيت بالله ربا وبالإسلام دين وبمحمد صلى الله عليه وسلم نبياً. ( 3 مرات )',
      descriotion4:
          ' حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم. (من قالها 7 مرات كفاه الله ما أهمه)',
      descriotion5:
          'يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طرفة عين.',
      descriotion6:
          '   اللهم انت ربي لا اله الا انت خلقتني وانا عبدك وانا علي عهدك ووعهدك ماستطعت اعوذ بك من شر ما صنعت وابوء لك بنعمتك علي وابوء بذنبي فاغفر لي فانه لا يغفر الذنوب الا انت   ',
      descriotion7:
          ' اللهم فاطر السماوات والأرض عالم الغيب والشهادة رب كل شي ومليكه أشهد أن لا إله إلا أنت أعوذ بك من شر نفسي ومن شر الشيطان وشركه وان اقترف على نفسي سوءا أو أجره لمسلم ',
      descriotion8:
          'أصبحنا وأصبح الملك لله والحمد لله ، لا إله إلا الله وحده لا شريك له ، له الملك وله الحمد وهو على كل شيء قدير . ربي أسألك خير ما في هذا اليوم وخير ما بعده . وأعوذ بك من شر ما في هذا اليوم وشر ما بعده ربي أعوذ بك من الكسل وسوء الكبر ، ربي أعوذ بك من عذاب في النار وعذاب في القبر.',
      descriotion10:
          'أصبحنا على فطرة الإسلام وعلى كلمة الإخلاص وعلى دين نبينا محمد صلى الله عليه وسلم وعلى ملة أبينا إبراهيم حنيفاً مسلماً وما كان من المشركين.',
      descriotion9:
          'اللهم اني اسالك العفو والعافيه في الدنيا والاخره اللهم اني اسالك العفو والعافيه في ديني ودنياي واهلي وماليواللهم اسنؤ عوراتي وامن روعاتي اللهم احفظني من بين يدي ومن خلفي وعن يمينيوعن شمالي واعوذ بعظمتك ان اغتال من تحتي '),
  Modaldetails(
      id: 'c2',
      title: ' أذكار المساء ',
      description:
          '  اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].    ',
      descriotion10:
          ' أمسينا على فطرة الإسلام وعلى كلمة الإخلاص وعلى دين نبينا محمد صلى الله عليه وسلم وعلى ملة أبينا إبراهيم حنيفاً مسلماً وما كان من المشركين.',
      descriotion2:
          ' آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ *لا يُكَلِّفُ اللَّهُ نَفْسًا إِلا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلا تُحَمِّلْنَا مَا لا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِين.َ  ',
      descriotion3:
          'بسـم الله الـذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم. (3 مرات)',
      descriotion4: 'أعوذ بكلمات الله التامات من شر ما خلق. (3 مرات)',
      descriotion5:
          'رضيت بالله ربا وبالإسلام دينا وبمحمد صلى الله عليه وسلم نبياً. (3 مرات)',
      descriotion6:
          'حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم. (من قالها 7 مرات كفاه الله ما أهمه)',
      descriotion7:
          'يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طرفة عين.',
      descriotion8:
          'قراءة المعوذتين (( قل أعوذ برب الفلق )) ، (( قل أعوذ برب الناس)) ',
      descriotion9:
          'امسينا وأمسى الملك لله والحمد لله ، لا اله إلا الله وحده لا شريك له ، له الملك وله الحمد ، وهو على كل شيء قدير ، ربي أسألك خير ما في هذا الليلة وخير ما بعدها ، أعوذ بك من شر ما في هذا الليلة وشر ما بعدها ، ربي أعوذ بك من الكسل وسوء الكبر ، ربي أعوذ بك من عذاب في النار وعذاب في القب '),
  Modaldetails(
      id: 'c3',
      title: 'أذكار النوم  ',
      description:
          '     بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين. مرة واحدة ',
      descriotion10:
          'قراءه سوره الملك  لها اجر عظيم فقد ثبت انها من الصور المباركه  التي تحتوي علي الاسرار والانوار',
      descriotion2:
          '     اللّهُـمَّ قِنـي عَذابَـكَ يَـوْمَ تَبْـعَثُ عِبـادَك. ثلاث مرات   ',
      descriotion3:
          '    اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها . اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة. مرة واحدة',
      descriotion4: '    بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا. مرة واحدة',
      descriotion5:
          '    الـحَمْدُ للهِ الَّذي أَطْـعَمَنا وَسَقـانا، وَكَفـانا، وَآوانا، فَكَـمْ مِمَّـنْ لا كـافِيَ لَـهُ وَلا مُـؤْوي. مرة واحدة',
      descriotion6:
          '    اللّهُـمَّ عالِـمَ الغَـيبِ وَالشّـهادةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كُـلِّ شَـيءٍ وَمَليـكَه، أَشْهـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي، وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم . مرة واحدة',
      descriotion7:
          '    اللّهُـمَّ أَسْـلَمْتُ نَفْـسي إِلَـيْكَ، وَفَوَّضْـتُ أَمْـري إِلَـيْكَ، وَوَجَّـهْتُ وَجْـهي إِلَـيْكَ، وَأَلْـجَـاْتُ ظَهـري إِلَـيْكَ، رَغْبَـةً وَرَهْـبَةً إِلَـيْكَ، لا مَلْجَـأَ وَلا مَنْـجـا مِنْـكَ إِلاّ إِلَـيْكَ، آمَنْـتُ بِكِتـابِكَ الّـذي أَنْزَلْـتَ وَبِنَبِـيِّـكَ الّـذي أَرْسَلْـت.',
      descriotion8:
          ',لله أكبر 34 مرةوسُبْحَانَ اللَّهِ 33 مرة,الحمد لله 33 مرة,',
      descriotion9:
          'اللهم رب السموات السبع ورب العرش العظيم ,فالق الحب والنوي,ومنزل التوراة والانجيلوالفرقان اعوذ بك من شر كل شئانت اخذ بناصيته,اللهم انت الاول فليس قبلك شئوانت الاخر فليس بعدك شئ وانت الظاهرفليس فوقك شئ وانت الباطن فليس دونك شئ اقض عنا الدين والفقر'),
  Modaldetails(
      id: 'c4',
      title: 'أدعية عامه  ',
      description:
          '  اللهم انت ربي لا اله الا انت حلقتني وانا عبدك وانا علي عهدك ووعدك ما استطعت اعوذ بك من شر ما صنعت ابوء لك بنعمتك علي وابوء بذنبي فاغفر لي فانه لا يغفر الذموب الا انت  ',
      descriotion10:
          'اللهم لك الحمد أنت نور السماوات والأرض ومن فيهن ولك الحمد، أنت قيوم السماوات والأرض ومن فيهن ولك الحمد، أنت الحق، ووعدك الحق، ولقاؤك حق، والجنة حق، والنار حق، والنبيون حق، والساعة حق، ومحمد حق، اللهم لك أسلمت، وبك آمنت، وعليك توكلت، وإليك أنبت، وبك خاصمت، وإليك حاكمت، فاغفر لى ما قدمت وما أخرت، وما أسررت وما أعلنت، أنت إلهى لا إله إلا أنت.',
      descriotion2:
          '((اللهم صل على محمد، وعلى آل محمد، كما صليت على إبراهيم، وعلى آل إبراهيم، إنك حميد مجيد، وبارك على محمد، وعلى آل محمد، كما باركت على إبراهيم، وعلى آل إبراهيم، [في العالمين] إنك حميد مجيد))',
      descriotion3:
          '((اللهم أحيني على سنة نبيك وتوفني على ملته، وأعذني من مضلات الفتن))',
      descriotion4:
          '((أستغفر الله العظيم الذي لا إله إلا هو، الحي القيوم، وأتوب إليه))',
      descriotion5: '((رب اغفر لي خطيئتي يوم الدين))',
      descriotion6:
          '((اللهم اهدني فيمن هديت، وعافني فيمن عافيت، وتولني فيمن توليت، وبارك لي فيما أعطيت، وقني شرما قضيت، إنه لا يذل من واليت، تباركت ربنا وتعاليت))',
      descriotion7:
          '((اللهم اغفر لي، اللهم اجعلني يوم القيامة فوق كثير من خلقك من الناس، اللهم اغفر لي ذنبي، وأدخلني يوم القيامة مدخلا كريما))',
      descriotion8: '((اللهم إني أسألك شهادة في سبيلك))',
      descriotion9:
          '((اللهم إني أعوذ بك من عذاب النار، وأعوذ بك من عذاب القبر، وأعوذ بك من الفتن ما ظهر منها وما بطن، وأعوذ بك من فتنة الدجال))'),
  Modaldetails(
      id: 'c5',
      title: 'دعاء الهم والحزن  ',
      description:
          ' اللهم إني عبدك، ابن عبدك، ابن أمتك، ناصيتي بيدك، ماض في حكمك، عدل في قضاؤك، أسألك بكل اسم هو لك سميت به نفسك، أو علمته أحدا من خلقك، أو أنزلته في كتابك، أو استأثرت به في علم الغيب عندك، أن تجعل القرآن ربيع قلبي، ونور صدري، وجلاء حزني، وذهاب همي . فقد أخبر النبي صلى الله عليه وسلم أن هذا الدعاء ما قاله أحد إلا أذهب الله همه، وأبدله مكان حزنه فرحا، قالوا: يا رسول الله ينبغي لنا أن نتعلم هؤلاء الكلمات؟ قال: أجل، يَنْبَغِي لمن سمعهن أن يتعلمهن. رواه أحمد وغيره، وصححه الألباني.',
      descriotion10:
          '((اللهم إني أعوذ بك من الهم والحزن، والعجز والكسل، والبخل والجبن ، وضلع الدين، وغلبة الرجال))',
      descriotion2: '((اللهم إني أسألك المعافاة في الدنيا والآخرة))',
      descriotion3:
          '((اللهم إني أعوذ بك من جار السوء، ومن زوج تشيبني قبل المشيب، ومن ولد يكون علي ربا، ومن مال يكون علي عذابا، ومن خليل ماكر عينه تراني، وقلبه يرعاني؛ إن رأى حسنة دفنها، وإذا رأى سيئة أذاعها))',
      descriotion4: '((اللهم جدد الإيمان في قلبي))',
      descriotion5:
          '((اللهم إني أسألك الثبات في الأمر، والعزيمة على الرشد، وأسألك موجبات رحمتك، وعزائم مغفرتك، وأسألك شكر نعمتك، وحسن عبادتك، وأسألك قلبا سليما، ولسانا صادقا، وأسألك من خير ما تعلم، وأعوذ بك من شر ما تعلم، وأستغفرك لما تعلم، إنك أنت علام الغيوب))',
      descriotion6: '((اللهم ثبتني واجعلني هاديا مهديا))',
      descriotion7: '((اللهم أحسنت خلقي فأحسن خلقي))',
      descriotion8:
          '((اللهم زدنا ولا تنقصنا، وأكرمنا ولا تهنا، وأعطنا ولا تحرمنا، وآثرنا ولا تؤثر علينا، وأرضنا وارض عنا))',
      descriotion9: '((اللهم اغفر لي، وارحمني، واهدني، وعافني، وارزقني))'),
  Modaldetails(
      id: 'c6',
      title: ' ادعية القرءان الكريم   ',
      description:
          ' "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ * الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ * الرَّحْمَنِ الرَّحِيمِ * مَالِكِ يَوْمِ الدِّينِ * إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ * اهْدِنَا الصِّرَاط الْمُسْتَقِيمَ * صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ " ',
      descriotion10:
          '"رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ"',
      descriotion2: '"وَتُبْ عَلَيْنَآ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ"',
      descriotion3:
          '"رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ"',
      descriotion4:
          '"سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِير"',
      descriotion5:
          '"رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ"',
      descriotion6:
          '"رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ"',
      descriotion7:
          '"رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ"',
      descriotion8:
          'رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ',
      descriotion9:
          '"رَبَّنَا مَا خَلَقْتَ هَذا بَاطِلاً سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ * رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ * رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ * رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ"'),
];
